app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is an Article Title"], ["text", "And this is Article Content"], ["created_at", "2018-03-12 18:06:29.425037"], ["updated_at", "2018-03-12 18:06:29.425037"]]
---
    def create
        @article = Article.new(article_params)
        @article.save