app/controllers/welcome_controller.rb

SELECT  "videos".* FROM "videos" ORDER BY "videos"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "audios".* FROM "audios" ORDER BY "audios"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @video = Video.last
    @video_authors = @video.authors
    @homepage_article = Article.last
    @article_authors = @homepage_article.authors
    @audio = Audio.last